# SQL II

Exploring advanced SQL syntax.

### Loading the Data
In this lecture, we'll continue our work with the `Dish` table. In the cells below, we connect to the database and query the table.

In [42]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [43]:
%%sql
sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db

'Connected: @D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db'

In [44]:
%%sql
SELECT * FROM sqlite_master WHERE type='table'

 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 7, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'Dragon', 'Dragon', 2, 'CREATE TABLE Dragon (\n    name TEXT PRIMARY KEY,\n    year INTEGER CHECK (year >= 2000),\n    cute INTEGER\n)'),
 ('table', 'Dish', 'Dish', 4, 'CREATE TABLE Dish (\n    name TEXT PRIMARY KEY,\n    type TEXT,\n    cost INTEGER CHECK (cost >= 0)\n)'),
 ('table', 'Scene', 'Scene', 6, "CREATE TABLE Scene (\n    id INTEGER PRIMARY KEY AUTOINCREMENT,\n    biome TEXT NOT NULL,\n    city TEXT NOT NULL,\n    visitors INTEGER CHECK (visitors >= 0),\n    created_at DATETIME DEFAULT (DATETIME('now'))\n)")]

**Question**: Query the entire **Dish** table.

In [45]:
%sql select * from Dish

 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('ravioli', 'entree', 10),
 ('ramen', 'entree', 13),
 ('taco', 'entree', 7),
 ('edamame', 'appetizer', 4),
 ('fries', 'appetizer', 4),
 ('potsticker', 'appetizer', 4),
 ('ice cream', 'dessert', 5)]

### Filtering Groups Using `HAVING`

**Question**: Query the total dishes of each type having a maximum cost of less than 8.

In [46]:
%%sql
SELECT type, COUNT(*) as Dish_Count
FROM Dish
GROUP BY type
HAVING COUNT(*) < 8;

 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('appetizer', 3), ('dessert', 1), ('entree', 3)]

### EDA in SQL

Our typical workflow when working with "big data" is:
* Use SQL to query data from a database
* Use Python (with `pandas`) to analyze this data in detail

We can, however, still perform simple data cleaning and re-structuring using SQL directly. To do so, we'll consider the `Title` table from the IMDB dataset. We use random ordering here to get a "snapshot" of representative rows sampled from throughout the table.

In [47]:
%%sql
sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db

'Connected: @D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db'

In [48]:
%%sql
SELECT *
FROM Title
ORDER BY RANDOM()
LIMIT 10;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(259288, 'movie', 'Dragonfly', 'Dragonfly', '0', '2002', None, '104', 'Drama,Fantasy,Mystery'),
 (831887, 'movie', 'The Spirit', 'The Spirit', '0', '2008', None, '103', 'Action,Crime,Fantasy'),
 (1234719, 'movie', 'Red Dawn', 'Red Dawn', '0', '2012', None, '93', 'Action,Drama'),
 (476735, 'movie', 'My Father and My Son', 'Babam ve Oglum', '0', '2005', None, '112', 'Drama,Family'),
 (923752, 'movie', 'The King of Kong: A Fistful of Quarters', 'The King of Kong', '0', '2007', None, '79', 'Biography,Documentary,Sport'),
 (1596350, 'movie', 'This Means War', 'This Means War', '0', '2012', None, '103', 'Action,Comedy,Romance'),
 (383694, 'movie', 'Vera Drake', 'Vera Drake', '0', '2004', None, '125', 'Crime,Drama'),
 (423977, 'movie', 'Charlie Bartlett', 'Charlie Bartlett', '0', '2007', None, '97', 'Comedy,Drama,Romance'),
 (2140379, 'movie', 'Self/less', 'Self/less', '0', '2015', None, '117', 'Action,Mystery,Sci-Fi'),
 (2625030, 'movie', 'New World', 'Sinsegye', '0', '2013', None, '135', 'Action,Crime,Drama')]

#### Matching Text Using `LIKE`

**Question**: Query the title types and primary title names with the primary title including the phrase "Star Wars".

In [49]:
%%sql
SELECT titleType, primaryTitle
FROM Title
WHERE primaryTitle LIKE '%Star Wars%'

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('movie', 'Star Wars: Episode IV - A New Hope'),
 ('movie', 'Star Wars: Episode V - The Empire Strikes Back'),
 ('movie', 'Star Wars: Episode VI - Return of the Jedi'),
 ('movie', 'Star Wars: Episode I - The Phantom Menace'),
 ('movie', 'Star Wars: Episode II - Attack of the Clones'),
 ('movie', 'Star Wars: Episode III - Revenge of the Sith'),
 ('tvSeries', 'Star Wars: Clone Wars'),
 ('tvSeries', 'Star Wars: The Clone Wars'),
 ('movie', 'Star Wars: The Clone Wars'),
 ('movie', 'Star Wars: Episode VII - The Force Awakens'),
 ('movie', 'Star Wars: Episode VIII - The Last Jedi'),
 ('movie', 'Star Wars: Episode IX - The Rise of Skywalker'),
 ('tvSeries', 'Star Wars Rebels'),
 ('movie', 'Rogue One: A Star Wars Story'),
 ('movie', 'Solo: A Star Wars Story')]

_ means “look for exactly 1 character”

In [50]:
%%sql
SELECT titleType, primaryTitle
FROM Title
WHERE primaryTitle LIKE "Harry Potter and the Deathly Hallows: Part _"

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('movie', 'Harry Potter and the Deathly Hallows: Part 1'),
 ('movie', 'Harry Potter and the Deathly Hallows: Part 2')]

#### Converting Data Types Using `CAST`

**Question**: Query the primary title and runtime (cast as integer) of any 10 movies.

In [51]:
%%sql
select primaryTitle, cast(runtimeMinutes as int)
from Title
Limit 10;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('A Trip to the Moon', 13),
 ('The Birth of a Nation', 195),
 ('The Cabinet of Dr. Caligari', 76),
 ('The Kid', 68),
 ('Nosferatu', 94),
 ('Sherlock Jr.', 45),
 ('Battleship Potemkin', 75),
 ('The Gold Rush', 95),
 ('Metropolis', 153),
 ('The General', 67)]

### Applying Conditions With `CASE`

Here, we return a random order so we can see the various movie ages (otherwise, the top few entries happen to all be old movies).

**Question**: Classify each movie title as 'new' if it was released before 1950 and 'mid-aged' if was released before 2000; label this column "movie_age". Select "title_type", "startYear" and "movie_age" in your query.

In [52]:
%%sql
SELECT titleType, startYear,
    CASE 
        WHEN startYear < 1950 THEN 'old'
        WHEN startYear < 2000 THEN 'mid-aged'
        ELSE 'new'
    END AS movie_age
FROM Title
Limit 10;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('short', '1902', 'old'),
 ('movie', '1915', 'old'),
 ('movie', '1920', 'old'),
 ('movie', '1921', 'old'),
 ('movie', '1922', 'old'),
 ('movie', '1924', 'old'),
 ('movie', '1925', 'old'),
 ('movie', '1925', 'old'),
 ('movie', '1927', 'old'),
 ('movie', '1926', 'old')]

### Joining Tables

We combine data from multiple tables by performing a **join**. We will explore joins using the cats database, which includes two tables: `s` and `t`.

In [53]:
%%sql
sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db

'Connected: @D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db'

In [54]:
%%sql
SELECT * FROM s;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(0, 'Apricot'), (1, 'Boots'), (2, 'Cally'), (4, 'Eugene')]

In [55]:
%%sql
SELECT * FROM t;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(1, 'persian'), (2, 'ragdoll'), (4, 'bengal'), (5, 'persian')]

#### Inner Join

**Question**: Perform inner join on tables **s** and **t**.

In [56]:
%%sql
select * 
    from s inner join t
    on s.id=t.id;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(1, 'Boots', 1, 'persian'),
 (2, 'Cally', 2, 'ragdoll'),
 (4, 'Eugene', 4, 'bengal')]

By default, `JOIN`ing without specifying a join type will default to an inner join.

**Question**: Perform inner join on tables **s** and **t** without specifying a join type.

In [57]:
%%sql
select * 
    from s join t
    on s.id=t.id

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(1, 'Boots', 1, 'persian'),
 (2, 'Cally', 2, 'ragdoll'),
 (4, 'Eugene', 4, 'bengal')]

### Cross Join

**Question**: Query every possible combination of rows across tables **s** and **t**.

In [58]:
%%sql
select *
from s cross join t

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(0, 'Apricot', 1, 'persian'),
 (0, 'Apricot', 2, 'ragdoll'),
 (0, 'Apricot', 4, 'bengal'),
 (0, 'Apricot', 5, 'persian'),
 (1, 'Boots', 1, 'persian'),
 (1, 'Boots', 2, 'ragdoll'),
 (1, 'Boots', 4, 'bengal'),
 (1, 'Boots', 5, 'persian'),
 (2, 'Cally', 1, 'persian'),
 (2, 'Cally', 2, 'ragdoll'),
 (2, 'Cally', 4, 'bengal'),
 (2, 'Cally', 5, 'persian'),
 (4, 'Eugene', 1, 'persian'),
 (4, 'Eugene', 2, 'ragdoll'),
 (4, 'Eugene', 4, 'bengal'),
 (4, 'Eugene', 5, 'persian')]

Conceptually, an inner join is equivalent to a cross join where irrelevant rows are removed.

**Question**: Perform inner join using cross join on tables **s** and **t**.

In [59]:
%%sql
SELECT *
FROM s CROSS JOIN t
WHERE s.id = t.id;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(1, 'Boots', 1, 'persian'),
 (2, 'Cally', 2, 'ragdoll'),
 (4, 'Eugene', 4, 'bengal')]

#### Left Outer Join

**Question**: Perform left outer join on tables **s** and **t**.

In [60]:
%%sql
select *
from s left join t
on s.id=t.id;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(0, 'Apricot', None, None),
 (1, 'Boots', 1, 'persian'),
 (2, 'Cally', 2, 'ragdoll'),
 (4, 'Eugene', 4, 'bengal')]

#### Right Outer Join

**Question**: Perform right outer join on tables **s** and **t**.

In [61]:
%%sql
select *
from s right join t
on s.id=t.id;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(1, 'Boots', 1, 'persian'),
 (2, 'Cally', 2, 'ragdoll'),
 (4, 'Eugene', 4, 'bengal'),
 (None, None, 5, 'persian')]

#### Full Outer Join

**Question**: Perform full outer join on tables **s** and **t**.

In [62]:
%%sql
select * from s full join t
on s.id=t.id;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(0, 'Apricot', None, None),
 (1, 'Boots', 1, 'persian'),
 (2, 'Cally', 2, 'ragdoll'),
 (4, 'Eugene', 4, 'bengal'),
 (None, None, 5, 'persian')]

#### Aliasing in Joins

Let's return to the IMDB dataset. Now, we'll consider two tables: `Title` and `Rating`.

In [63]:
%%sql
sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db

'Connected: @D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db'

When working with tables that have long names, we often create an **alias** using the `AS` keyword (much like we did with columns in the previous lecture). This makes it easier to reference these tables when performing a join.

**Question**: Perform inner join on tables **Title** (alias T) and **Rating** (alias R).

In [64]:
%%sql 
SELECT * FROM sqlite_master WHERE type='table'

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('table', 'Title', 'Title', 2, 'CREATE TABLE "Title" (\n"tconst" INTEGER,\n  "titleType" TEXT,\n  "primaryTitle" TEXT,\n  "originalTitle" TEXT,\n  "isAdult" TEXT,\n  "startYear" TEXT,\n  "endYear" TEXT,\n  "runtimeMinutes" TEXT,\n  "genres" TEXT\n)'),
 ('table', 'Name', 'Name', 12, 'CREATE TABLE "Name" (\n"nconst" INTEGER,\n  "primaryName" TEXT,\n  "birthYear" TEXT,\n  "deathYear" TEXT,\n  "primaryProfession" TEXT\n)'),
 ('table', 'Role', 'Role', 70, 'CREATE TABLE "Role" (\ntconst INTEGER,\nordering TEXT,\nnconst INTEGER,\ncategory TEXT,\njob TEXT,\ncharacters TEXT\n)'),
 ('table', 'Rating', 'Rating', 41, 'CREATE TABLE "Rating" (\ntconst INTEGER,\naverageRating TEXT,\nnumVotes TEXT\n)')]

In [65]:
%%sql
select * from Title
Limit 10;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(417, 'short', 'A Trip to the Moon', 'Le voyage dans la lune', '0', '1902', None, '13', 'Action,Adventure,Comedy'),
 (4972, 'movie', 'The Birth of a Nation', 'The Birth of a Nation', '0', '1915', None, '195', 'Drama,History,War'),
 (10323, 'movie', 'The Cabinet of Dr. Caligari', 'Das Cabinet des Dr. Caligari', '0', '1920', None, '76', 'Fantasy,Horror,Mystery'),
 (12349, 'movie', 'The Kid', 'The Kid', '0', '1921', None, '68', 'Comedy,Drama,Family'),
 (13442, 'movie', 'Nosferatu', 'Nosferatu, eine Symphonie des Grauens', '0', '1922', None, '94', 'Fantasy,Horror'),
 (15324, 'movie', 'Sherlock Jr.', 'Sherlock Jr.', '0', '1924', None, '45', 'Action,Comedy,Romance'),
 (15648, 'movie', 'Battleship Potemkin', 'Bronenosets Potemkin', '0', '1925', None, '75', 'Drama,History,Thriller'),
 (15864, 'movie', 'The Gold Rush', 'The Gold Rush', '0', '1925', None, '95', 'Adventure,Comedy,Drama'),
 (17136, 'movie', 'Metropolis', 'Metropolis', '0', '1927', None, '153', 'Drama,Sci-Fi'),
 (17925, 'movie', 'The General', 'The General', '0', '1926', None, '67', 'Action,Adventure,Comedy')]

In [66]:
%%sql
select * from Rating
Limit 10;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[(417, '8.2', '46382'),
 (4972, '6.3', '23836'),
 (10323, '8.1', '60244'),
 (12349, '8.3', '120059'),
 (13442, '7.9', '92218'),
 (15324, '8.2', '45878'),
 (15648, '8.0', '55425'),
 (15864, '8.2', '106386'),
 (17136, '8.3', '166671'),
 (17925, '8.1', '86751')]

In [67]:
%%sql
select primaryTitle,averageRating
from Title as T inner join Rating as R
on T.tconst = R.tconst
Limit 10;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
Done.

[('A Trip to the Moon', '8.2'),
 ('The Birth of a Nation', '6.3'),
 ('The Cabinet of Dr. Caligari', '8.1'),
 ('The Kid', '8.3'),
 ('Nosferatu', '7.9'),
 ('Sherlock Jr.', '8.2'),
 ('Battleship Potemkin', '8.0'),
 ('The Gold Rush', '8.2'),
 ('Metropolis', '8.3'),
 ('The General', '8.1')]

Referencing columns using the full or aliased table name is important to avoid ambiguity. Suppose the tables we are trying to join both include a column with the same name, like the `tconst` columns present in both the `Title` and `Rating` tables of the IMDB database. If we do not specify which table's column we wish to reference, SQL will not be able to process our query.

In the cell below, it is unclear if we are referring to the `tconst` column from the `Title` table or the `tconst` column from the `Rating` table. SQL errors.

In [71]:
%%sql
SELECT primaryTitle, averageRating
FROM Title AS T INNER JOIN Rating AS R
ON tconst = tconst;

   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples.db
   sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/basic_examples2.db
 * sqlite:///D:/Knowledege_Streams_Course/04_sql/Assignments/imdbmini.db
(sqlite3.OperationalError) ambiguous column name: tconst
[SQL: SELECT primaryTitle, averageRating
FROM Title AS T INNER JOIN Rating AS R
ON tconst = tconst;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)